from django.db import models

# Create your models here.
class BotDataBase(models.Model):
    catlist = [('ГоловаГромади','ГоловаГромади'),('ЗаступникиГолови','ЗаступникиГолови'),
               ('Старости','Старости'),('Відділи','Відділи'),
               ('Ательє', 'Ательє'), ('Аптеки', 'Аптеки'),
               ('Кафе','Кафе'),('Бари','Бари'),('Клуби','Клуби'),('Ресторани','Ресторани'),
               ('Фастфуди','Фастфуди'),('Клініки','Клініки'),('Салони_краси','Салони_краси'),('Спортзали','Спортзали'),
               ('Банки','Банки'),('Казначейство','Казначейство'),('КредитніСпілки','КредитніСпілки'),
               ('РемонтАвто','РемонтАвто'),('РемонтТехніки','РемонтТехніки'),
               ('Нотаріуси','Нотаріуси'),('ДитячеДозвілля','ДитячеДозвілля'),
               ('МагПродуктові','МагПродуктові'),('МагДитячі','МагДитячі'),('МагГосподарські','МагГосподарські'),
               ('МагОдягТаВзуття','МагОдягТаВзуття'),('МагВетиринарні','МагВетиринарні'),
               ('МагПосуд','МагПосуд'),('МагКвіти','МагКвіти'),('ГосподарськіМагазини','ГосподарськіМагазини'),
               ('Канцелярія','Канцелярія'),('Клініки','Клініки'),('Салони_краси','Салони_краси'),
               ('СпортивніЗалиФітнес','СпортивніЗалиФітнес'),('Голова_громади','Голова_громади'),
               ('Заступники_голови','Заступники_голови'),('Старости','Старости'),('Відділи','Відділи'),
               ('Школи_І_ступенів','Школи_І_ступенів'),('Школи_ІІ_ступенів','Школи_ІІ_ступенів'),
               ('Школи_ІІІ_ступенів','Школи_ІІІ_ступенів'),('Садочки','Садочки'),('Позашкільна освіта','Позашкільна освіта'),
               ('ЦКіДи','ЦКіДи'),('МузеїСадиби','МузеїСадиби'),('Бібліотеки','Бібліотеки'),('Туризм','Туризм'),
               ('міськаЛікарня','міськаЛікарня'),('СімейніЛікарі','СімейніЛікарі'),('Ветеринарія','Ветеринарія'),
               ('Аптеки','Аптеки'),('Стоматології','Стоматології'),('Укрпошта','Укрпошта'),
               ('ЦентрЗайнятості','ЦентрЗайнятості')]

    PhotoURL = models.URLField(verbose_name="Url зсилка фото", max_length=200)
    Name = models.CharField(verbose_name="Назва", max_length=200)
    About = models.CharField(verbose_name="Опис", max_length=400, default="")
    town = models.CharField(verbose_name="Місто", max_length=200, default="Теребовля")
    category = models.CharField(verbose_name="Категорія", max_length=300, choices=catlist)
    address = models.CharField(verbose_name="Адреса", max_length=300)
    tel = models.CharField(verbose_name="Телефон", max_length=100, blank=True)
    work_schedule = models.CharField(verbose_name="Робочий графік", max_length=100, blank=True)
    SiteURL = models.URLField(verbose_name="Сайт", max_length=300, blank=True)
    FaсebookURL = models.URLField(verbose_name="Фейсбук", max_length=300, default="", blank=True)
    InstagramURL = models.URLField(verbose_name="Інстаграм", max_length=300, default="", blank=True)
    coordinates = models.CharField(verbose_name="Кординати", max_length=300, default="", blank=True)

    class Meta:
        verbose_name_plural = 'Компанії'
        verbose_name = 'Компанії'

    def __str__(self):
        return self.Name